const JSONData = {
    "تداخل کلاس ها": {
        "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>": [
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>": [
            "1211019_01|الكترونيك 1|ازوجي مهدي<br>",
            "1211019_02|الكترونيك 1|عزيزاله گنجي بهرام<br>",
            "1211019_03|الكترونيك 1|اردشير غلامرضا<br>",
            "1211020_02|الكترونيك 2|بالغي دماوندي ياسر<br>",
            "1221013_01|شبكه هاي كامپيوتري|منصوري مجتبي<br>",
            "1221029_01|پايگاه داده ها|عمادي مهدي<br>",
            "1221047_02|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221097_01|هم طراحي سخت افزار - نرم افزار|عدل سيدمحمدتقي<br>"
        ],
        "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1211005_02|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>": [
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>"
        ],
        "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>": [
            "1211038_01|برنامه نويسي كامپيوتر|نصيرايي محمد<br>",
            "1211049_01|اصول سيستم هاي مخابراتي|ذهابي محمد رضا<br>",
            "1211049_02|اصول سيستم هاي مخابراتي|حسيني اندارگلي سيد مهدي<br>",
            "1211051_03|سيستم هاي ديجيتال 1|جوادي محسن<br>",
            "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار|حسن پور سيده باهره<br>"
        ],
        "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>": [
            "1211018_01|الكترومغناطيس|يزدي محمد<br>",
            "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>",
            "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>",
            "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>",
            "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>"
        ],
        "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1211011_04|كارگاه برق|بارفروشي تقي<br>حيدري رضا<br>": [
            "1211038_01|برنامه نويسي كامپيوتر|نصيرايي محمد<br>",
            "1211049_01|اصول سيستم هاي مخابراتي|ذهابي محمد رضا<br>",
            "1211049_02|اصول سيستم هاي مخابراتي|حسيني اندارگلي سيد مهدي<br>",
            "1211051_03|سيستم هاي ديجيتال 1|جوادي محسن<br>",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار|حسن پور سيده باهره<br>"
        ],
        "1211011_05|كارگاه برق|حيدري رضا<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1211012_01|زبان تخصصي|قريشي هدي<br>": [
            "1211005_02|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211013_02|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>": [
            "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>",
            "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>",
            "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>",
            "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>"
        ],
        "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>": [
            "1211005_02|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211014_02|رياضي مهندسي|ميناگر سارا<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>": [
            "1211013_02|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211053_01|آز مدارهاي الكتريكي و اندازه گيري|حسيني سيدمهدي<br>",
            "1211058_01|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1211058_02|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1221019_05|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221058_01|روش پژوهش و ارايه|زماني فاطمه<br>"
        ],
        "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>": [
            "1211013_02|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211053_01|آز مدارهاي الكتريكي و اندازه گيري|حسيني سيدمهدي<br>",
            "1211058_01|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1211058_02|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1221019_05|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221058_01|روش پژوهش و ارايه|زماني فاطمه<br>"
        ],
        "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>": [
            "1211013_02|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211053_01|آز مدارهاي الكتريكي و اندازه گيري|حسيني سيدمهدي<br>",
            "1211058_01|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1211058_02|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1221019_05|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221058_01|روش پژوهش و ارايه|زماني فاطمه<br>"
        ],
        "1211018_01|الكترومغناطيس|يزدي محمد<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211019_01|الكترونيك 1|ازوجي مهدي<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1211019_02|الكترونيك 1|عزيزاله گنجي بهرام<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1211019_03|الكترونيك 1|اردشير غلامرضا<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1211020_02|الكترونيك 2|بالغي دماوندي ياسر<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>": [
            "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>",
            "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>",
            "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>",
            "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>": [
            "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>",
            "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>",
            "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>",
            "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>": [
            "1211019_01|الكترونيك 1|ازوجي مهدي<br>",
            "1211019_02|الكترونيك 1|عزيزاله گنجي بهرام<br>",
            "1211019_03|الكترونيك 1|اردشير غلامرضا<br>",
            "1211020_02|الكترونيك 2|بالغي دماوندي ياسر<br>",
            "1221013_01|شبكه هاي كامپيوتري|منصوري مجتبي<br>",
            "1221029_01|پايگاه داده ها|عمادي مهدي<br>",
            "1221047_02|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221097_01|هم طراحي سخت افزار - نرم افزار|عدل سيدمحمدتقي<br>"
        ],
        "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>",
            "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>",
            "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>",
            "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>": [
            "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>",
            "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>",
            "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>",
            "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211038_01|برنامه نويسي كامپيوتر|نصيرايي محمد<br>": [
            "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_04|كارگاه برق|بارفروشي تقي<br>حيدري رضا<br>",
            "1221107_02|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>"
        ],
        "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1211049_01|اصول سيستم هاي مخابراتي|ذهابي محمد رضا<br>": [
            "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_04|كارگاه برق|بارفروشي تقي<br>حيدري رضا<br>",
            "1221107_02|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>"
        ],
        "1211049_02|اصول سيستم هاي مخابراتي|حسيني اندارگلي سيد مهدي<br>": [
            "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_04|كارگاه برق|بارفروشي تقي<br>حيدري رضا<br>",
            "1221107_02|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>"
        ],
        "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211051_03|سيستم هاي ديجيتال 1|جوادي محسن<br>": [
            "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_04|كارگاه برق|بارفروشي تقي<br>حيدري رضا<br>",
            "1221107_02|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>"
        ],
        "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1211053_01|آز مدارهاي الكتريكي و اندازه گيري|حسيني سيدمهدي<br>": [
            "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>",
            "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>",
            "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>",
            "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>"
        ],
        "1211053_03|آز مدارهاي الكتريكي و اندازه گيري|عباسي فاضل<br>": [
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>"
        ],
        "1211054_01|آز الكترونيك|نصيرايي محمد<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>": [
            "1211005_02|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>": [
            "1211018_01|الكترومغناطيس|يزدي محمد<br>",
            "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>",
            "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>",
            "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>",
            "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>"
        ],
        "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>": [
            "1211005_02|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>": [
            "1211005_02|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1211058_01|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>": [
            "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>",
            "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>",
            "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>",
            "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>"
        ],
        "1211058_02|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>": [
            "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>",
            "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>",
            "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>"
        ],
        "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211053_03|آز مدارهاي الكتريكي و اندازه گيري|عباسي فاضل<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221056_02|آزمايشگاه سيستم هاي عامل|سلحشور فاطمه<br>",
            "1221057_02|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_04|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>"
        ],
        "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>": [
            "1211013_02|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211053_01|آز مدارهاي الكتريكي و اندازه گيري|حسيني سيدمهدي<br>",
            "1211058_01|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1211058_02|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1221019_05|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221058_01|روش پژوهش و ارايه|زماني فاطمه<br>"
        ],
        "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1221013_01|شبكه هاي كامپيوتري|منصوري مجتبي<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1221019_05|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>": [
            "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>",
            "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>",
            "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>",
            "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>"
        ],
        "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>": [
            "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>",
            "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>",
            "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>",
            "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>",
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>",
            "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>"
        ],
        "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>": [
            "1211019_01|الكترونيك 1|ازوجي مهدي<br>",
            "1211019_02|الكترونيك 1|عزيزاله گنجي بهرام<br>",
            "1211019_03|الكترونيك 1|اردشير غلامرضا<br>",
            "1211020_02|الكترونيك 2|بالغي دماوندي ياسر<br>",
            "1221013_01|شبكه هاي كامپيوتري|منصوري مجتبي<br>",
            "1221029_01|پايگاه داده ها|عمادي مهدي<br>",
            "1221047_02|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221097_01|هم طراحي سخت افزار - نرم افزار|عدل سيدمحمدتقي<br>"
        ],
        "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>": [
            "1211019_01|الكترونيك 1|ازوجي مهدي<br>",
            "1211019_02|الكترونيك 1|عزيزاله گنجي بهرام<br>",
            "1211019_03|الكترونيك 1|اردشير غلامرضا<br>",
            "1211020_02|الكترونيك 2|بالغي دماوندي ياسر<br>",
            "1221013_01|شبكه هاي كامپيوتري|منصوري مجتبي<br>",
            "1221029_01|پايگاه داده ها|عمادي مهدي<br>",
            "1221047_02|رياضيات گسسته|عبداله زاده آهنگر حسين<br>",
            "1221097_01|هم طراحي سخت افزار - نرم افزار|عدل سيدمحمدتقي<br>"
        ],
        "1221028_01|مهندسي اينترنت|عمادي مهدي<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221029_01|پايگاه داده ها|عمادي مهدي<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>",
            "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>",
            "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>",
            "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>",
            "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>",
            "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>",
            "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>",
            "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>"
        ],
        "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211018_01|الكترومغناطيس|يزدي محمد<br>",
            "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>",
            "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>",
            "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>",
            "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>"
        ],
        "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221035_01|مهندسي نرم افزار|جزايري حميد<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221044_01|يادگيري ماشين|زماني فاطمه<br>": [
            "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>",
            "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>",
            "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>",
            "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1221047_02|رياضيات گسسته|عبداله زاده آهنگر حسين<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>": [
            "1211011_06|كارگاه برق|عراقي عبدالرحيم<br>",
            "1211013_04|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_02|آز الكترونيك|سليماني اميري سمانه<br>",
            "1221019_01|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>",
            "1221019_02|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>",
            "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>": [
            "1211005_04|آزمايشگاه سيستمهاي كنترل خطي|عباسي نوذري حسن<br>",
            "1211011_05|كارگاه برق|حيدري رضا<br>",
            "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>",
            "1211054_01|آز الكترونيك|نصيرايي محمد<br>",
            "1221019_03|آزمايشگاه شبكه كامپيوتري|يزدانيان اميري زهرا<br>",
            "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>",
            "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221056_02|آزمايشگاه سيستم هاي عامل|سلحشور فاطمه<br>": [
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>"
        ],
        "1221057_02|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>": [
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>"
        ],
        "1221057_03|آزمايشگاه مدارهاي منطقي و معماري كامپيوتر|يزدانيان اميري زهرا<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1221058_01|روش پژوهش و ارايه|زماني فاطمه<br>": [
            "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>",
            "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>",
            "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>"
        ],
        "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>": [
            "1211018_01|الكترومغناطيس|يزدي محمد<br>",
            "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>",
            "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>",
            "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>",
            "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>"
        ],
        "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221086_01|پردازش موازي|غلامي رودي علي<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>": [
            "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211013_02|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211053_01|آز مدارهاي الكتريكي و اندازه گيري|حسيني سيدمهدي<br>",
            "1211058_01|آزمايشگاه كنترل صنعتي|رضايي بهروز<br>حسين زاده محمدحسن<br>",
            "1221019_05|آزمايشگاه شبكه كامپيوتري|فيروزمندي همت<br>"
        ],
        "1221097_01|هم طراحي سخت افزار - نرم افزار|عدل سيدمحمدتقي<br>": [
            "1211003_05|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211035_01|آزمايشگاه آنتن|ذاكري گتابي بيژن<br>",
            "1221027_03|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_04|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>"
        ],
        "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>": [
            "1211011_01|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211055_03|آز سيستم هاي ديجيتال 1|عراقي عبدالرحيم<br>",
            "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221068_01|آزمايشگاه  ابزارهاي طراحي با كمك كامپيوتر|قلي زاده اهنگري رويا<br>",
            "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>",
            "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221107_02|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>": [
            "1211038_01|برنامه نويسي كامپيوتر|نصيرايي محمد<br>",
            "1211049_01|اصول سيستم هاي مخابراتي|ذهابي محمد رضا<br>",
            "1211049_02|اصول سيستم هاي مخابراتي|حسيني اندارگلي سيد مهدي<br>",
            "1211051_03|سيستم هاي ديجيتال 1|جوادي محسن<br>",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار|حسن پور سيده باهره<br>"
        ],
        "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1221108_04|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>": [
            "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>"
        ],
        "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>": [
            "1211005_01|آزمايشگاه سيستمهاي كنترل خطي|كاربيني طلايه<br>",
            "1211011_02|كارگاه برق|نوروزپور نيازي احمد<br>ميرزائي زرينكلائي قدرت الله<br>",
            "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>",
            "1211055_02|آز سيستم هاي ديجيتال 1|قلي پور گشنياني مرتضي<br>نصيرايي محمد<br>",
            "1221027_01|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221027_02|آزمايشگاه ريزپردازنده|گل شعبانعلي<br>",
            "1221107_03|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>",
            "1221108_01|كارگاه برنامه نويسي متلب|منتظري كردي حسين<br>",
            "1221108_02|كارگاه برنامه نويسي متلب|ابراهيمي خاله سري فريده<br>",
            "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>"
        ],
        "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>": [
            "1211003_02|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211012_01|زبان تخصصي|قريشي هدي<br>",
            "1211013_03|نقشه كشي مهندسي (صنعتي)|محمدتبار نفيسه<br>",
            "1211054_04|آز الكترونيك|سليماني اميري سمانه<br>",
            "1211055_04|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211055_05|آز سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211056_02|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_05|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1221023_01|آزمايشگاه مدارهاي الكترونيكي|سليماني اميري سمانه<br>"
        ],
        "1221120_02|آزمايشگاه مهندسي نرم افزار|آهنگري مجيد<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1221125_01|كارگاه مباني كامپيوتر و برنامه نويسي|قلي زاده اهنگري رويا<br>": [
            "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>",
            "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>",
            "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>",
            "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>",
            "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>",
            "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>",
            "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>"
        ],
        "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1221127_02|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1221128_01|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>": [
            "1211018_01|الكترومغناطيس|يزدي محمد<br>",
            "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>",
            "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>",
            "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>",
            "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>"
        ],
        "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>": [
            "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>",
            "1211014_02|رياضي مهندسي|ميناگر سارا<br>",
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>",
            "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>",
            "1221035_01|مهندسي نرم افزار|جزايري حميد<br>",
            "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>",
            "1221086_01|پردازش موازي|غلامي رودي علي<br>",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>",
            "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>",
            "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>"
        ],
        "1221128_03|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1221128_04|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>": [
            "1211018_01|الكترومغناطيس|يزدي محمد<br>",
            "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>",
            "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>",
            "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>",
            "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>",
            "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>",
            "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>"
        ],
        "1221128_05|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>": [
            "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>",
            "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>",
            "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>",
            "1221009_01|نظريه زبانها و ماشينها|ميرپور مرزوني سيدسعيد<br>",
            "1221028_01|مهندسي اينترنت|عمادي مهدي<br>",
            "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>",
            "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>"
        ],
        "1221128_06|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>": [
            "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>",
            "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>",
            "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>",
            "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>",
            "1221044_01|يادگيري ماشين|زماني فاطمه<br>",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>"
        ],
        "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ],
        "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>": [
            "1211003_01|آزمايشگاه ماشين هاي الكتريكي1|عبدالهي سيد احسان<br>",
            "1211003_06|آزمايشگاه ماشين هاي الكتريكي1|جعفري نوكندي ميثم<br>",
            "1211013_01|نقشه كشي مهندسي (صنعتي)|خورشيدي پاچي معصومه<br>",
            "1211054_03|آز الكترونيك|مراديان فاطمه<br>جناني مبينا<br>",
            "1211055_01|آز سيستم هاي ديجيتال 1|ازوجي مهدي<br>",
            "1211056_01|آز سيستم هاي ديجيتال 2|گل شعبانعلي<br>",
            "1211056_04|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221018_01|آزمايشگاه الكترونيك ديجيتال|جوادي محسن<br>",
            "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>"
        ],
        "1221138_01|برنامه نويسي وب و دستگاههاي سيار|حسن پور سيده باهره<br>": [
            "1211005_06|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_04|كارگاه برق|بارفروشي تقي<br>حيدري رضا<br>",
            "1221107_02|آزمايشگاه پايگاه داده|سلحشور فاطمه<br>"
        ],
        "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>": [
            "1211005_03|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211005_05|آزمايشگاه سيستمهاي كنترل خطي|ساداتي رستمي سيد جليل<br>اميري ارمان<br>",
            "1211011_03|كارگاه برق|حيدري رضا<br>عزيز پور آرش<br>",
            "1211056_03|آز سيستم هاي ديجيتال 2|اردشير غلامرضا<br>",
            "1221108_03|كارگاه برنامه نويسي متلب|سخائي سيدمحمود<br>",
            "1221127_01|كارگاه آشنايي با مهندسي كامپيوتر|دوست فرهي سپيده<br>",
            "1221128_02|كارگاه برنامه نويسي پيشرفته|چيتگر نگار<br>"
        ]
    },
    "تداخل امتحانات": {
        "1211012_01|زبان تخصصي|قريشي هدي<br>": [
            "1211012_02|زبان تخصصي",
            "1211036_02|آمار و احتمالات مهندسي",
            "1211036_03|آمار و احتمالات مهندسي",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال"
        ],
        "1211012_02|زبان تخصصي|ادبي فيروزجايي جعفر<br>": [
            "1211012_01|زبان تخصصي",
            "1211036_02|آمار و احتمالات مهندسي",
            "1211036_03|آمار و احتمالات مهندسي",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال"
        ],
        "1211014_01|رياضي مهندسي|رنجبرنوعي ابوالفضل<br>": [
            "1211014_02|رياضي مهندسي",
            "1211049_01|اصول سيستم هاي مخابراتي",
            "1211049_02|اصول سيستم هاي مخابراتي",
            "1221028_01|مهندسي اينترنت"
        ],
        "1211014_02|رياضي مهندسي|ميناگر سارا<br>": [
            "1211014_01|رياضي مهندسي",
            "1211049_01|اصول سيستم هاي مخابراتي",
            "1211049_02|اصول سيستم هاي مخابراتي",
            "1221028_01|مهندسي اينترنت"
        ],
        "1211015_01|مدارهاي الكتريكي 1|ميرزائي محمد<br>": [
            "1211015_02|مدارهاي الكتريكي 1",
            "1211020_01|الكترونيك 2",
            "1211020_02|الكترونيك 2",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته",
            "1221103_01|مباني نظريه بازي ها",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي"
        ],
        "1211015_02|مدارهاي الكتريكي 1|حسيني سيدمهدي<br>": [
            "1211015_01|مدارهاي الكتريكي 1",
            "1211020_01|الكترونيك 2",
            "1211020_02|الكترونيك 2",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته",
            "1221103_01|مباني نظريه بازي ها",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي"
        ],
        "1211016_01|مدارهاي الكتريكي 2|جعفري نوكندي ميثم<br>": [
            "1211016_02|مدارهاي الكتريكي 2",
            "1211016_03|مدارهاي الكتريكي 2",
            "1211038_01|برنامه نويسي كامپيوتر",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي"
        ],
        "1211016_02|مدارهاي الكتريكي 2|قريشي هدي<br>": [
            "1211016_01|مدارهاي الكتريكي 2",
            "1211016_03|مدارهاي الكتريكي 2",
            "1211038_01|برنامه نويسي كامپيوتر",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي"
        ],
        "1211016_03|مدارهاي الكتريكي 2|يزدي محمد<br>": [
            "1211016_01|مدارهاي الكتريكي 2",
            "1211016_02|مدارهاي الكتريكي 2",
            "1211038_01|برنامه نويسي كامپيوتر",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي"
        ],
        "1211018_01|الكترومغناطيس|يزدي محمد<br>": [
            "1211018_02|الكترومغناطيس",
            "1221031_01|زبان تخصصي",
            "1221031_02|زبان تخصصي",
            "1221097_01|هم طراحي سخت افزار - نرم افزار",
            "1221158_01|هوش مصنوعي پيشرفته"
        ],
        "1211018_02|الكترومغناطيس|حسيني نژاد سيداحسان<br>": [
            "1211018_01|الكترومغناطيس",
            "1221031_01|زبان تخصصي",
            "1221031_02|زبان تخصصي",
            "1221097_01|هم طراحي سخت افزار - نرم افزار",
            "1221158_01|هوش مصنوعي پيشرفته"
        ],
        "1211019_01|الكترونيك 1|ازوجي مهدي<br>": [
            "1211019_02|الكترونيك 1",
            "1211019_03|الكترونيك 1",
            "1211044_01|آشنايي بامهندسي برق",
            "1221035_01|مهندسي نرم افزار",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري"
        ],
        "1211019_02|الكترونيك 1|عزيزاله گنجي بهرام<br>": [
            "1211019_01|الكترونيك 1",
            "1211019_03|الكترونيك 1",
            "1211044_01|آشنايي بامهندسي برق",
            "1221035_01|مهندسي نرم افزار",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري"
        ],
        "1211019_03|الكترونيك 1|اردشير غلامرضا<br>": [
            "1211019_01|الكترونيك 1",
            "1211019_02|الكترونيك 1",
            "1211044_01|آشنايي بامهندسي برق",
            "1221035_01|مهندسي نرم افزار",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري"
        ],
        "1211020_01|الكترونيك 2|عزيزاله گنجي بهرام<br>": [
            "1211015_01|مدارهاي الكتريكي 1",
            "1211015_02|مدارهاي الكتريكي 1",
            "1211020_02|الكترونيك 2",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته",
            "1221103_01|مباني نظريه بازي ها",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي"
        ],
        "1211020_02|الكترونيك 2|بالغي دماوندي ياسر<br>": [
            "1211015_01|مدارهاي الكتريكي 1",
            "1211015_02|مدارهاي الكتريكي 1",
            "1211020_01|الكترونيك 2",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته",
            "1221103_01|مباني نظريه بازي ها",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي"
        ],
        "1211021_01|ماشينهاي الكتريكي 1|غلاميان سيد اصغر<br>": [
            "1211021_02|ماشينهاي الكتريكي 1",
            "1211021_03|ماشينهاي الكتريكي 1",
            "1221036_01|معماري كامپيوتر",
            "1221036_02|معماري كامپيوتر"
        ],
        "1211021_02|ماشينهاي الكتريكي 1|عبدالهي سيد احسان<br>": [
            "1211021_01|ماشينهاي الكتريكي 1",
            "1211021_03|ماشينهاي الكتريكي 1",
            "1221036_01|معماري كامپيوتر",
            "1221036_02|معماري كامپيوتر"
        ],
        "1211021_03|ماشينهاي الكتريكي 1|جعفري نوكندي ميثم<br>": [
            "1211021_01|ماشينهاي الكتريكي 1",
            "1211021_02|ماشينهاي الكتريكي 1",
            "1221036_01|معماري كامپيوتر",
            "1221036_02|معماري كامپيوتر"
        ],
        "1211022_01|ماشينهاي الكتريكي 2|جعفري نوكندي ميثم<br>": [
            "1211022_02|ماشينهاي الكتريكي 2",
            "1221005_01|ساختمان داده ها",
            "1221034_01|طراحي مدارهاي واسط",
            "1221126_01|پايگاه داده پيشرفته"
        ],
        "1211022_02|ماشينهاي الكتريكي 2|عبدالهي سيد احسان<br>": [
            "1211022_01|ماشينهاي الكتريكي 2",
            "1221005_01|ساختمان داده ها",
            "1221034_01|طراحي مدارهاي واسط",
            "1221126_01|پايگاه داده پيشرفته"
        ],
        "1211025_01|سيستمهاي كنترل خطي|رنجبرنوعي ابوالفضل<br>": [
            "1211025_02|سيستمهاي كنترل خطي",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم",
            "1221114_01|بازيابي اطلاعات پيشرفته",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار"
        ],
        "1211025_02|سيستمهاي كنترل خطي|خسروي عليرضا<br>": [
            "1211025_01|سيستمهاي كنترل خطي",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم",
            "1221114_01|بازيابي اطلاعات پيشرفته",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار"
        ],
        "1211036_02|آمار و احتمالات مهندسي|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211012_01|زبان تخصصي",
            "1211012_02|زبان تخصصي",
            "1211036_03|آمار و احتمالات مهندسي",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال"
        ],
        "1211036_03|آمار و احتمالات مهندسي|سخائي سيدمحمود<br>": [
            "1211012_01|زبان تخصصي",
            "1211012_02|زبان تخصصي",
            "1211036_02|آمار و احتمالات مهندسي",
            "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال"
        ],
        "1211038_01|برنامه نويسي كامپيوتر|نصيرايي محمد<br>": [
            "1211016_01|مدارهاي الكتريكي 2",
            "1211016_02|مدارهاي الكتريكي 2",
            "1211016_03|مدارهاي الكتريكي 2",
            "1221131_01|مباني و كاربردهاي هوش مصنوعي"
        ],
        "1211044_01|آشنايي بامهندسي برق|حسيني نژاد سيداحسان<br>": [
            "1211019_01|الكترونيك 1",
            "1211019_02|الكترونيك 1",
            "1211019_03|الكترونيك 1",
            "1221035_01|مهندسي نرم افزار",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري"
        ],
        "1211049_01|اصول سيستم هاي مخابراتي|ذهابي محمد رضا<br>": [
            "1211014_01|رياضي مهندسي",
            "1211014_02|رياضي مهندسي",
            "1211049_02|اصول سيستم هاي مخابراتي",
            "1221028_01|مهندسي اينترنت"
        ],
        "1211049_02|اصول سيستم هاي مخابراتي|حسيني اندارگلي سيد مهدي<br>": [
            "1211014_01|رياضي مهندسي",
            "1211014_02|رياضي مهندسي",
            "1211049_01|اصول سيستم هاي مخابراتي",
            "1221028_01|مهندسي اينترنت"
        ],
        "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1|بارفروشي تقي<br>": [
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1",
            "1221012_01|سيستمهاي عامل",
            "1221081_01|حساب كامپيوتري"
        ],
        "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1|شهابي مجيد<br>": [
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1",
            "1221012_01|سيستمهاي عامل",
            "1221081_01|حساب كامپيوتري"
        ],
        "1211051_01|سيستم هاي ديجيتال 1|بالغي دماوندي ياسر<br>": [
            "1211051_02|سيستم هاي ديجيتال 1",
            "1211051_03|سيستم هاي ديجيتال 1",
            "1221050_01|مدارهاي منطقي",
            "1221086_01|پردازش موازي"
        ],
        "1211051_02|سيستم هاي ديجيتال 1|حسن زاده محمدرضا<br>": [
            "1211051_01|سيستم هاي ديجيتال 1",
            "1211051_03|سيستم هاي ديجيتال 1",
            "1221050_01|مدارهاي منطقي",
            "1221086_01|پردازش موازي"
        ],
        "1211051_03|سيستم هاي ديجيتال 1|جوادي محسن<br>": [
            "1211051_01|سيستم هاي ديجيتال 1",
            "1211051_02|سيستم هاي ديجيتال 1",
            "1221050_01|مدارهاي منطقي",
            "1221086_01|پردازش موازي"
        ],
        "1211052_01|سيستم هاي ديجيتال 2|قلي پور گشنياني مرتضي<br>": [
            "1211052_02|سيستم هاي ديجيتال 2",
            "1221017_01|انتقال داده ها",
            "1221055_01|اصول طراحي كامپايلر"
        ],
        "1211052_02|سيستم هاي ديجيتال 2|ازوجي مهدي<br>": [
            "1211052_01|سيستم هاي ديجيتال 2",
            "1221017_01|انتقال داده ها",
            "1221055_01|اصول طراحي كامپايلر"
        ],
        "1221003_01|برنامه نويسي پيشرفته|مقصودي نوشين<br>": [
            "1221010_01|الكترونيك ديجيتال",
            "1221044_01|يادگيري ماشين",
            "1221046_01|مباني كامپيوتر و برنامه نويسي",
            "1221130_01|جبر خطي كاربردي"
        ],
        "1221005_01|ساختمان داده ها|عمرانپور بندپي حسام<br>": [
            "1211022_01|ماشينهاي الكتريكي 2",
            "1211022_02|ماشينهاي الكتريكي 2",
            "1221034_01|طراحي مدارهاي واسط",
            "1221126_01|پايگاه داده پيشرفته"
        ],
        "1221008_01|طراحي الگوريتمها|زماني فاطمه<br>": [
            "1221104_01|الگوريتمهاي پيشرفته كارشناسي"
        ],
        "1221010_01|الكترونيك ديجيتال|جوادي محسن<br>": [
            "1221003_01|برنامه نويسي پيشرفته",
            "1221044_01|يادگيري ماشين",
            "1221046_01|مباني كامپيوتر و برنامه نويسي",
            "1221130_01|جبر خطي كاربردي"
        ],
        "1221012_01|سيستمهاي عامل|غلامي رودي علي<br>": [
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1",
            "1221081_01|حساب كامپيوتري"
        ],
        "1221013_01|شبكه هاي كامپيوتري|منصوري مجتبي<br>": [
            "1221109_01|نظريه الگوريتمي بازي ها"
        ],
        "1221016_01|طراحي سيستمهاي مجتمع پرتراكم|نصيرايي محمد<br>": [
            "1211025_01|سيستمهاي كنترل خطي",
            "1211025_02|سيستمهاي كنترل خطي",
            "1221114_01|بازيابي اطلاعات پيشرفته",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار"
        ],
        "1221017_01|انتقال داده ها|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211052_01|سيستم هاي ديجيتال 2",
            "1211052_02|سيستم هاي ديجيتال 2",
            "1221055_01|اصول طراحي كامپايلر"
        ],
        "1221024_01|سيگنالها و سيستمها|سخائي سيدمحمود<br>": [
            "1221024_02|سيگنالها و سيستمها",
            "1221024_03|سيگنالها و سيستمها",
            "1221024_04|سيگنالها و سيستمها",
            "1221024_05|سيگنالها و سيستمها"
        ],
        "1221024_02|سيگنالها و سيستمها|آقا گل زاده علي<br>": [
            "1221024_01|سيگنالها و سيستمها",
            "1221024_03|سيگنالها و سيستمها",
            "1221024_04|سيگنالها و سيستمها",
            "1221024_05|سيگنالها و سيستمها"
        ],
        "1221024_03|سيگنالها و سيستمها|كرمي ملايي محمدرضا<br>": [
            "1221024_01|سيگنالها و سيستمها",
            "1221024_02|سيگنالها و سيستمها",
            "1221024_04|سيگنالها و سيستمها",
            "1221024_05|سيگنالها و سيستمها"
        ],
        "1221024_04|سيگنالها و سيستمها|منتظري كردي حسين<br>": [
            "1221024_01|سيگنالها و سيستمها",
            "1221024_02|سيگنالها و سيستمها",
            "1221024_03|سيگنالها و سيستمها",
            "1221024_05|سيگنالها و سيستمها"
        ],
        "1221024_05|سيگنالها و سيستمها|سخائي سيدمحمود<br>": [
            "1221024_01|سيگنالها و سيستمها",
            "1221024_02|سيگنالها و سيستمها",
            "1221024_03|سيگنالها و سيستمها",
            "1221024_04|سيگنالها و سيستمها"
        ],
        "1221028_01|مهندسي اينترنت|عمادي مهدي<br>": [
            "1211014_01|رياضي مهندسي",
            "1211014_02|رياضي مهندسي",
            "1211049_01|اصول سيستم هاي مخابراتي",
            "1211049_02|اصول سيستم هاي مخابراتي"
        ],
        "1221029_01|پايگاه داده ها|عمادي مهدي<br>": [
            "1221038_01|سيستم هاي عامل پيشرفته",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي"
        ],
        "1221031_01|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211018_01|الكترومغناطيس",
            "1211018_02|الكترومغناطيس",
            "1221031_02|زبان تخصصي",
            "1221097_01|هم طراحي سخت افزار - نرم افزار",
            "1221158_01|هوش مصنوعي پيشرفته"
        ],
        "1221031_02|زبان تخصصي|كاظمي تبار اميركلايي سيد جواد<br>": [
            "1211018_01|الكترومغناطيس",
            "1211018_02|الكترومغناطيس",
            "1221031_01|زبان تخصصي",
            "1221097_01|هم طراحي سخت افزار - نرم افزار",
            "1221158_01|هوش مصنوعي پيشرفته"
        ],
        "1221034_01|طراحي مدارهاي واسط|رادمهر علي<br>": [
            "1211022_01|ماشينهاي الكتريكي 2",
            "1211022_02|ماشينهاي الكتريكي 2",
            "1221005_01|ساختمان داده ها",
            "1221126_01|پايگاه داده پيشرفته"
        ],
        "1221035_01|مهندسي نرم افزار|جزايري حميد<br>": [
            "1211019_01|الكترونيك 1",
            "1211019_02|الكترونيك 1",
            "1211019_03|الكترونيك 1",
            "1211044_01|آشنايي بامهندسي برق",
            "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري"
        ],
        "1221036_01|معماري كامپيوتر|ولي نتاج مجتبي<br>": [
            "1211021_01|ماشينهاي الكتريكي 1",
            "1211021_02|ماشينهاي الكتريكي 1",
            "1211021_03|ماشينهاي الكتريكي 1",
            "1221036_02|معماري كامپيوتر"
        ],
        "1221036_02|معماري كامپيوتر|عدل سيدمحمدتقي<br>": [
            "1211021_01|ماشينهاي الكتريكي 1",
            "1211021_02|ماشينهاي الكتريكي 1",
            "1211021_03|ماشينهاي الكتريكي 1",
            "1221036_01|معماري كامپيوتر"
        ],
        "1221038_01|سيستم هاي عامل پيشرفته|عمادي مهدي<br>": [
            "1221029_01|پايگاه داده ها",
            "1221105_01|مقدمه اي بر مسابقات برنامه نويسي"
        ],
        "1221044_01|يادگيري ماشين|زماني فاطمه<br>": [
            "1221003_01|برنامه نويسي پيشرفته",
            "1221010_01|الكترونيك ديجيتال",
            "1221046_01|مباني كامپيوتر و برنامه نويسي",
            "1221130_01|جبر خطي كاربردي"
        ],
        "1221046_01|مباني كامپيوتر و برنامه نويسي|زماني فاطمه<br>": [
            "1221003_01|برنامه نويسي پيشرفته",
            "1221010_01|الكترونيك ديجيتال",
            "1221044_01|يادگيري ماشين",
            "1221130_01|جبر خطي كاربردي"
        ],
        "1221047_01|رياضيات گسسته|عبداله زاده آهنگر حسين<br>": [
            "1221047_02|رياضيات گسسته",
            "1221096_01|طراحي زبانهاي برنامه سازي"
        ],
        "1221047_02|رياضيات گسسته|عبداله زاده آهنگر حسين<br>": [
            "1221047_01|رياضيات گسسته",
            "1221096_01|طراحي زبانهاي برنامه سازي"
        ],
        "1221050_01|مدارهاي منطقي|كرمي ملايي محمدرضا<br>": [
            "1211051_01|سيستم هاي ديجيتال 1",
            "1211051_02|سيستم هاي ديجيتال 1",
            "1211051_03|سيستم هاي ديجيتال 1",
            "1221086_01|پردازش موازي"
        ],
        "1221052_01|طراحي كامپيوتري سيستم هاي ديجيتال|ولي نتاج مجتبي<br>": [
            "1211012_01|زبان تخصصي",
            "1211012_02|زبان تخصصي",
            "1211036_02|آمار و احتمالات مهندسي",
            "1211036_03|آمار و احتمالات مهندسي"
        ],
        "1221055_01|اصول طراحي كامپايلر|غلامي رودي علي<br>": [
            "1211052_01|سيستم هاي ديجيتال 2",
            "1211052_02|سيستم هاي ديجيتال 2",
            "1221017_01|انتقال داده ها"
        ],
        "1221065_01|تحليل و طراحي سيستم هاي نرم افزاري|جزايري حميد<br>": [
            "1211019_01|الكترونيك 1",
            "1211019_02|الكترونيك 1",
            "1211019_03|الكترونيك 1",
            "1211044_01|آشنايي بامهندسي برق",
            "1221035_01|مهندسي نرم افزار"
        ],
        "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته|عدل سيدمحمدتقي<br>": [
            "1211015_01|مدارهاي الكتريكي 1",
            "1211015_02|مدارهاي الكتريكي 1",
            "1211020_01|الكترونيك 2",
            "1211020_02|الكترونيك 2",
            "1221103_01|مباني نظريه بازي ها",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي"
        ],
        "1221081_01|حساب كامپيوتري|ولي نتاج مجتبي<br>": [
            "1211050_01|تحليل سيستم هاي انرژي الكتريكي 1",
            "1211050_02|تحليل سيستم هاي انرژي الكتريكي 1",
            "1221012_01|سيستمهاي عامل"
        ],
        "1221086_01|پردازش موازي|غلامي رودي علي<br>": [
            "1211051_01|سيستم هاي ديجيتال 1",
            "1211051_02|سيستم هاي ديجيتال 1",
            "1211051_03|سيستم هاي ديجيتال 1",
            "1221050_01|مدارهاي منطقي"
        ],
        "1221096_01|طراحي زبانهاي برنامه سازي|منصوري مجتبي<br>": [
            "1221047_01|رياضيات گسسته",
            "1221047_02|رياضيات گسسته"
        ],
        "1221097_01|هم طراحي سخت افزار - نرم افزار|عدل سيدمحمدتقي<br>": [
            "1211018_01|الكترومغناطيس",
            "1211018_02|الكترومغناطيس",
            "1221031_01|زبان تخصصي",
            "1221031_02|زبان تخصصي",
            "1221158_01|هوش مصنوعي پيشرفته"
        ],
        "1221103_01|مباني نظريه بازي ها|جزايري حميد<br>": [
            "1211015_01|مدارهاي الكتريكي 1",
            "1211015_02|مدارهاي الكتريكي 1",
            "1211020_01|الكترونيك 2",
            "1211020_02|الكترونيك 2",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته",
            "1221129_01|مدارهاي الكتريكي و الكترونيكي"
        ],
        "1221104_01|الگوريتمهاي پيشرفته كارشناسي|عمرانپور بندپي حسام<br>": [
            "1221008_01|طراحي الگوريتمها"
        ],
        "1221105_01|مقدمه اي بر مسابقات برنامه نويسي|مقصودي نوشين<br>": [
            "1221029_01|پايگاه داده ها",
            "1221038_01|سيستم هاي عامل پيشرفته"
        ],
        "1221109_01|نظريه الگوريتمي بازي ها|جزايري حميد<br>": [
            "1221013_01|شبكه هاي كامپيوتري"
        ],
        "1221114_01|بازيابي اطلاعات پيشرفته|منصوري مجتبي<br>": [
            "1211025_01|سيستمهاي كنترل خطي",
            "1211025_02|سيستمهاي كنترل خطي",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم",
            "1221138_01|برنامه نويسي وب و دستگاههاي سيار"
        ],
        "1221126_01|پايگاه داده پيشرفته|عمادي مهدي<br>": [
            "1211022_01|ماشينهاي الكتريكي 2",
            "1211022_02|ماشينهاي الكتريكي 2",
            "1221005_01|ساختمان داده ها",
            "1221034_01|طراحي مدارهاي واسط"
        ],
        "1221129_01|مدارهاي الكتريكي و الكترونيكي|ابراهيمي خاله سري فريده<br>": [
            "1211015_01|مدارهاي الكتريكي 1",
            "1211015_02|مدارهاي الكتريكي 1",
            "1211020_01|الكترونيك 2",
            "1211020_02|الكترونيك 2",
            "1221080_01|طراحي و ارزيابي سيستم هاي بي درنگ نهفته",
            "1221103_01|مباني نظريه بازي ها"
        ],
        "1221130_01|جبر خطي كاربردي|مقصودي نوشين<br>": [
            "1221003_01|برنامه نويسي پيشرفته",
            "1221010_01|الكترونيك ديجيتال",
            "1221044_01|يادگيري ماشين",
            "1221046_01|مباني كامپيوتر و برنامه نويسي"
        ],
        "1221131_01|مباني و كاربردهاي هوش مصنوعي|عمرانپور بندپي حسام<br>": [
            "1211016_01|مدارهاي الكتريكي 2",
            "1211016_02|مدارهاي الكتريكي 2",
            "1211016_03|مدارهاي الكتريكي 2",
            "1211038_01|برنامه نويسي كامپيوتر"
        ],
        "1221138_01|برنامه نويسي وب و دستگاههاي سيار|حسن پور سيده باهره<br>": [
            "1211025_01|سيستمهاي كنترل خطي",
            "1211025_02|سيستمهاي كنترل خطي",
            "1221016_01|طراحي سيستمهاي مجتمع پرتراكم",
            "1221114_01|بازيابي اطلاعات پيشرفته"
        ],
        "1221158_01|هوش مصنوعي پيشرفته|عمرانپور بندپي حسام<br>": [
            "1211018_01|الكترومغناطيس",
            "1211018_02|الكترومغناطيس",
            "1221031_01|زبان تخصصي",
            "1221031_02|زبان تخصصي",
            "1221097_01|هم طراحي سخت افزار - نرم افزار"
        ]
    }
}